IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/ECC_AGG_TOP_ECC_AGG_TOP.xml
<module name="ECC_AGG_TOP_ECC_AGG_TOP" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="ECC_AGG_TOP_REV" acronym="ECC_AGG_TOP_REV" offset="0x0" width="32" description="">
		<bitfield id="SCHEME" width="2" begin="31" end="30" resetval="0x1" description="Scheme" range="31 - 30" rwaccess="RO"/> 
		<bitfield id="BU" width="2" begin="29" end="28" resetval="0x2" description="bu" range="29 - 28" rwaccess="RO"/> 
		<bitfield id="MODULE_ID" width="12" begin="27" end="16" resetval="0x1696" description="Module ID" range="27 - 16" rwaccess="RO"/> 
		<bitfield id="REVRTL" width="5" begin="15" end="11" resetval="0x29" description="RTL version" range="15 - 11" rwaccess="RO"/> 
		<bitfield id="REVMAJ" width="3" begin="10" end="8" resetval="0x2" description="Major version" range="10 - 8" rwaccess="RO"/> 
		<bitfield id="CUSTOM" width="2" begin="7" end="6" resetval="0x0" description="Custom version" range="7 - 6" rwaccess="RO"/> 
		<bitfield id="REVMIN" width="6" begin="5" end="0" resetval="0x0" description="Minor version" range="5 - 0" rwaccess="RO"/>
	</register>
	<register id="ECC_AGG_TOP_VECTOR" acronym="ECC_AGG_TOP_VECTOR" offset="0x8" width="24" description="">
		<bitfield id="RD_SVBUS_DONE" width="1" begin="24" end="24" resetval="0x0" description="Status to indicate if read on serial VBUS is complete, write of any value will clear this bit." range="24" rwaccess="RW"/> 
		<bitfield id="RD_SVBUS_ADDRESS" width="8" begin="23" end="16" resetval="0x0" description="Read address" range="23 - 16" rwaccess="RW"/> 
		<bitfield id="RD_SVBUS" width="1" begin="15" end="15" resetval="0x0" description="Write 1 to trigger a read on the serial VBUS" range="15" rwaccess="RW"/> 
		<bitfield id="ECC_VECTOR" width="11" begin="10" end="0" resetval="0x0" description="Value written to select the corresponding ECC RAM for control or status" range="10 - 0" rwaccess="RW"/>
	</register>
	<register id="ECC_AGG_TOP_STAT" acronym="ECC_AGG_TOP_STAT" offset="0xC" width="16" description="">
		<bitfield id="NUM_RAMS" width="11" begin="10" end="0" resetval="0x9" description="Indicates the number of RAMS serviced by the ECC aggregator" range="10 - 0" rwaccess="RO"/>
	</register>
	<register id="ECC_AGG_TOP_CTRL" acronym="ECC_AGG_TOP_CTRL" offset="0x14" width="8" description="">
		<bitfield id="CHECK_SVBUS_TIMEOUT" width="1" begin="8" end="8" resetval="0x1" description="check for svbus timeout errors" range="8" rwaccess="RW"/> 
		<bitfield id="CHECK_PARITY" width="1" begin="7" end="7" resetval="0x1" description="check for parity errors" range="7" rwaccess="RW"/> 
		<bitfield id="ERROR_ONCE" width="1" begin="6" end="6" resetval="0x0" description="Force Error only once" range="6" rwaccess="RW"/> 
		<bitfield id="FORCE_N_ROW" width="1" begin="5" end="5" resetval="0x0" description="Force Error on any RAM read" range="5" rwaccess="RW"/> 
		<bitfield id="FORCE_DED" width="1" begin="4" end="4" resetval="0x0" description="Force Double Bit Error" range="4" rwaccess="RW"/> 
		<bitfield id="FORCE_SEC" width="1" begin="3" end="3" resetval="0x0" description="Force Single Bit Error" range="3" rwaccess="RW"/> 
		<bitfield id="ENABLE_RMW" width="1" begin="2" end="2" resetval="0x1" description="Enable rmw" range="2" rwaccess="RW"/> 
		<bitfield id="ECC_CHECK" width="1" begin="1" end="1" resetval="0x1" description="Enable ECC check" range="1" rwaccess="RW"/> 
		<bitfield id="ECC_ENABLE" width="1" begin="0" end="0" resetval="0x1" description="Enable ECC" range="0" rwaccess="RW"/>
	</register>
	<register id="ECC_AGG_TOP_ERR_CTRL1" acronym="ECC_AGG_TOP_ERR_CTRL1" offset="0x18" width="32" description="">
		<bitfield id="ECC_ROW" width="32" begin="31" end="0" resetval="0x0" description="Row address where single or double-bit error needs to be applied. This is ignored if force_n_row is set" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="ECC_AGG_TOP_ERR_CTRL2" acronym="ECC_AGG_TOP_ERR_CTRL2" offset="0x1C" width="32" description="">
		<bitfield id="ECC_BIT2" width="16" begin="31" end="16" resetval="0x0" description="Data bit that needs to be flipped if double bit error needs to be forced" range="31 - 16" rwaccess="RW"/> 
		<bitfield id="ECC_BIT1" width="16" begin="15" end="0" resetval="0x0" description="Data bit that needs to be flipped when force_sec is set" range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="ECC_AGG_TOP_ERR_STAT1" acronym="ECC_AGG_TOP_ERR_STAT1" offset="0x20" width="32" description="">
		<bitfield id="ECC_BIT1" width="16" begin="31" end="16" resetval="0x0" description="Data bit that corresponds to the single-bit error" range="31 - 16" rwaccess="RO"/> 
		<bitfield id="CLR_CTRL_REG_ERR" width="1" begin="15" end="15" resetval="0x0" description="Clear control reg error Error Status, you must also re write the contorl ergister itself to clear this" range="15" rwaccess="RW"/> 
		<bitfield id="CLR_PARITY_ERR" width="2" begin="14" end="13" resetval="0x0" description="Clear parity Error Status" range="14 - 13" rwaccess="RW
	  			 DECR"/> 
		<bitfield id="CLR_ECC_OTHER" width="1" begin="12" end="12" resetval="0x0" description="Clear other Error Status" range="12" rwaccess="RW"/> 
		<bitfield id="CLR_ECC_DED" width="2" begin="11" end="10" resetval="0x0" description="Clear Double Bit Error Status" range="11 - 10" rwaccess="RW
	  			 DECR"/> 
		<bitfield id="CLR_ECC_SEC" width="2" begin="9" end="8" resetval="0x0" description="Clear Single Bit Error Status" range="9 - 8" rwaccess="RW
	  			 DECR"/> 
		<bitfield id="CTR_REG_ERR" width="1" begin="7" end="7" resetval="0x0" description="control register error pending, Level interrupt" range="7" rwaccess="RW"/> 
		<bitfield id="PARITY_ERR" width="2" begin="6" end="5" resetval="0x0" description="Level parity error Error Status" range="6 - 5" rwaccess="RW"/> 
		<bitfield id="ECC_OTHER" width="1" begin="4" end="4" resetval="0x0" description="successive single-bit errors have occurred while a writeback is still pending, Level interrupt" range="4" rwaccess="RW"/> 
		<bitfield id="ECC_DED" width="2" begin="3" end="2" resetval="0x0" description="Level Double Bit Error Status" range="3 - 2" rwaccess="RW
	  			 INCR"/> 
		<bitfield id="ECC_SEC" width="2" begin="1" end="0" resetval="0x0" description="Level Single Bit Error Status" range="1 - 0" rwaccess="RW
	  			 INCR"/>
	</register>
	<register id="ECC_AGG_TOP_ERR_STAT2" acronym="ECC_AGG_TOP_ERR_STAT2" offset="0x24" width="32" description="">
		<bitfield id="ECC_ROW" width="32" begin="31" end="0" resetval="0x0" description="Row address where the single or double-bit error has occurred" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="ECC_AGG_TOP_ERR_STAT3" acronym="ECC_AGG_TOP_ERR_STAT3" offset="0x28" width="16" description="">
		<bitfield id="CLR_SVBUS_TIMEOUT_ERR" width="1" begin="9" end="9" resetval="0x0" description="Clear svbus timeout Error Status" range="9" rwaccess="RW"/> 
		<bitfield id="SVBUS_TIMEOUT_ERR" width="1" begin="1" end="1" resetval="0x0" description="Level svbus timeout error Error Status" range="1" rwaccess="RW"/> 
		<bitfield id="WB_PEND" width="1" begin="0" end="0" resetval="0x0" description="delayed write back pending  Status" range="0" rwaccess="RO"/>
	</register>
	<register id="ECC_AGG_TOP_SEC_EOI_REG" acronym="ECC_AGG_TOP_SEC_EOI_REG" offset="0x3C" width="0" description="">
		<bitfield id="EOI_WR" width="1" begin="0" end="0" resetval="0x0" description="EOI Register" range="0" rwaccess="RW"/>
	</register>
	<register id="ECC_AGG_TOP_SEC_STATUS_REG0" acronym="ECC_AGG_TOP_SEC_STATUS_REG0" offset="0x40" width="8" description="">
		<bitfield id="TPTC_A1_PEND" width="1" begin="6" end="6" resetval="0x0" description="Interrupt Pending Status for tptc_a1_pend" range="6" rwaccess="RW"/> 
		<bitfield id="TPTC_A0_PEND" width="1" begin="5" end="5" resetval="0x0" description="Interrupt Pending Status for tptc_a0_pend" range="5" rwaccess="RW"/> 
		<bitfield id="MSS_MBOX_PEND" width="1" begin="4" end="4" resetval="0x0" description="Interrupt Pending Status for mss_mbox_pend" range="4" rwaccess="RW"/> 
		<bitfield id="MSS_L2SLV3_PEND" width="1" begin="3" end="3" resetval="0x0" description="Interrupt Pending Status for mss_l2slv3_pend" range="3" rwaccess="RW"/> 
		<bitfield id="MSS_L2SLV2_PEND" width="1" begin="2" end="2" resetval="0x0" description="Interrupt Pending Status for mss_l2slv2_pend" range="2" rwaccess="RW"/> 
		<bitfield id="MSS_L2SLV1_PEND" width="1" begin="1" end="1" resetval="0x0" description="Interrupt Pending Status for mss_l2slv1_pend" range="1" rwaccess="RW"/> 
		<bitfield id="MSS_L2SLV0_PEND" width="1" begin="0" end="0" resetval="0x0" description="Interrupt Pending Status for mss_l2slv0_pend" range="0" rwaccess="RW"/>
	</register>
	<register id="ECC_AGG_TOP_SEC_ENABLE_SET_REG0" acronym="ECC_AGG_TOP_SEC_ENABLE_SET_REG0" offset="0x80" width="8" description="">
		<bitfield id="TPTC_A1_ENABLE_SET" width="1" begin="6" end="6" resetval="0x0" description="Interrupt Enable Set Register for tptc_a1_pend" range="6" rwaccess="RW"/> 
		<bitfield id="TPTC_A0_ENABLE_SET" width="1" begin="5" end="5" resetval="0x0" description="Interrupt Enable Set Register for tptc_a0_pend" range="5" rwaccess="RW"/> 
		<bitfield id="MSS_MBOX_ENABLE_SET" width="1" begin="4" end="4" resetval="0x0" description="Interrupt Enable Set Register for mss_mbox_pend" range="4" rwaccess="RW"/> 
		<bitfield id="MSS_L2SLV3_ENABLE_SET" width="1" begin="3" end="3" resetval="0x0" description="Interrupt Enable Set Register for mss_l2slv3_pend" range="3" rwaccess="RW"/> 
		<bitfield id="MSS_L2SLV2_ENABLE_SET" width="1" begin="2" end="2" resetval="0x0" description="Interrupt Enable Set Register for mss_l2slv2_pend" range="2" rwaccess="RW"/> 
		<bitfield id="MSS_L2SLV1_ENABLE_SET" width="1" begin="1" end="1" resetval="0x0" description="Interrupt Enable Set Register for mss_l2slv1_pend" range="1" rwaccess="RW"/> 
		<bitfield id="MSS_L2SLV0_ENABLE_SET" width="1" begin="0" end="0" resetval="0x0" description="Interrupt Enable Set Register for mss_l2slv0_pend" range="0" rwaccess="RW"/>
	</register>
	<register id="ECC_AGG_TOP_SEC_ENABLE_CLR_REG0" acronym="ECC_AGG_TOP_SEC_ENABLE_CLR_REG0" offset="0xC0" width="8" description="">
		<bitfield id="TPTC_A1_ENABLE_CLR" width="1" begin="6" end="6" resetval="0x0" description="Interrupt Enable Clear Register for tptc_a1_pend" range="6" rwaccess="RW"/> 
		<bitfield id="TPTC_A0_ENABLE_CLR" width="1" begin="5" end="5" resetval="0x0" description="Interrupt Enable Clear Register for tptc_a0_pend" range="5" rwaccess="RW"/> 
		<bitfield id="MSS_MBOX_ENABLE_CLR" width="1" begin="4" end="4" resetval="0x0" description="Interrupt Enable Clear Register for mss_mbox_pend" range="4" rwaccess="RW"/> 
		<bitfield id="MSS_L2SLV3_ENABLE_CLR" width="1" begin="3" end="3" resetval="0x0" description="Interrupt Enable Clear Register for mss_l2slv3_pend" range="3" rwaccess="RW"/> 
		<bitfield id="MSS_L2SLV2_ENABLE_CLR" width="1" begin="2" end="2" resetval="0x0" description="Interrupt Enable Clear Register for mss_l2slv2_pend" range="2" rwaccess="RW"/> 
		<bitfield id="MSS_L2SLV1_ENABLE_CLR" width="1" begin="1" end="1" resetval="0x0" description="Interrupt Enable Clear Register for mss_l2slv1_pend" range="1" rwaccess="RW"/> 
		<bitfield id="MSS_L2SLV0_ENABLE_CLR" width="1" begin="0" end="0" resetval="0x0" description="Interrupt Enable Clear Register for mss_l2slv0_pend" range="0" rwaccess="RW"/>
	</register>
	<register id="ECC_AGG_TOP_DED_EOI_REG" acronym="ECC_AGG_TOP_DED_EOI_REG" offset="0x13C" width="0" description="">
		<bitfield id="EOI_WR" width="1" begin="0" end="0" resetval="0x0" description="EOI Register" range="0" rwaccess="RW"/>
	</register>
	<register id="ECC_AGG_TOP_DED_STATUS_REG0" acronym="ECC_AGG_TOP_DED_STATUS_REG0" offset="0x140" width="8" description="">
		<bitfield id="TPTC_A1_PEND" width="1" begin="6" end="6" resetval="0x0" description="Interrupt Pending Status for tptc_a1_pend" range="6" rwaccess="RW"/> 
		<bitfield id="TPTC_A0_PEND" width="1" begin="5" end="5" resetval="0x0" description="Interrupt Pending Status for tptc_a0_pend" range="5" rwaccess="RW"/> 
		<bitfield id="MSS_MBOX_PEND" width="1" begin="4" end="4" resetval="0x0" description="Interrupt Pending Status for mss_mbox_pend" range="4" rwaccess="RW"/> 
		<bitfield id="MSS_L2SLV3_PEND" width="1" begin="3" end="3" resetval="0x0" description="Interrupt Pending Status for mss_l2slv3_pend" range="3" rwaccess="RW"/> 
		<bitfield id="MSS_L2SLV2_PEND" width="1" begin="2" end="2" resetval="0x0" description="Interrupt Pending Status for mss_l2slv2_pend" range="2" rwaccess="RW"/> 
		<bitfield id="MSS_L2SLV1_PEND" width="1" begin="1" end="1" resetval="0x0" description="Interrupt Pending Status for mss_l2slv1_pend" range="1" rwaccess="RW"/> 
		<bitfield id="MSS_L2SLV0_PEND" width="1" begin="0" end="0" resetval="0x0" description="Interrupt Pending Status for mss_l2slv0_pend" range="0" rwaccess="RW"/>
	</register>
	<register id="ECC_AGG_TOP_DED_ENABLE_SET_REG0" acronym="ECC_AGG_TOP_DED_ENABLE_SET_REG0" offset="0x180" width="8" description="">
		<bitfield id="TPTC_A1_ENABLE_SET" width="1" begin="6" end="6" resetval="0x0" description="Interrupt Enable Set Register for tptc_a1_pend" range="6" rwaccess="RW"/> 
		<bitfield id="TPTC_A0_ENABLE_SET" width="1" begin="5" end="5" resetval="0x0" description="Interrupt Enable Set Register for tptc_a0_pend" range="5" rwaccess="RW"/> 
		<bitfield id="MSS_MBOX_ENABLE_SET" width="1" begin="4" end="4" resetval="0x0" description="Interrupt Enable Set Register for mss_mbox_pend" range="4" rwaccess="RW"/> 
		<bitfield id="MSS_L2SLV3_ENABLE_SET" width="1" begin="3" end="3" resetval="0x0" description="Interrupt Enable Set Register for mss_l2slv3_pend" range="3" rwaccess="RW"/> 
		<bitfield id="MSS_L2SLV2_ENABLE_SET" width="1" begin="2" end="2" resetval="0x0" description="Interrupt Enable Set Register for mss_l2slv2_pend" range="2" rwaccess="RW"/> 
		<bitfield id="MSS_L2SLV1_ENABLE_SET" width="1" begin="1" end="1" resetval="0x0" description="Interrupt Enable Set Register for mss_l2slv1_pend" range="1" rwaccess="RW"/> 
		<bitfield id="MSS_L2SLV0_ENABLE_SET" width="1" begin="0" end="0" resetval="0x0" description="Interrupt Enable Set Register for mss_l2slv0_pend" range="0" rwaccess="RW"/>
	</register>
	<register id="ECC_AGG_TOP_DED_ENABLE_CLR_REG0" acronym="ECC_AGG_TOP_DED_ENABLE_CLR_REG0" offset="0x1C0" width="8" description="">
		<bitfield id="TPTC_A1_ENABLE_CLR" width="1" begin="6" end="6" resetval="0x0" description="Interrupt Enable Clear Register for tptc_a1_pend" range="6" rwaccess="RW"/> 
		<bitfield id="TPTC_A0_ENABLE_CLR" width="1" begin="5" end="5" resetval="0x0" description="Interrupt Enable Clear Register for tptc_a0_pend" range="5" rwaccess="RW"/> 
		<bitfield id="MSS_MBOX_ENABLE_CLR" width="1" begin="4" end="4" resetval="0x0" description="Interrupt Enable Clear Register for mss_mbox_pend" range="4" rwaccess="RW"/> 
		<bitfield id="MSS_L2SLV3_ENABLE_CLR" width="1" begin="3" end="3" resetval="0x0" description="Interrupt Enable Clear Register for mss_l2slv3_pend" range="3" rwaccess="RW"/> 
		<bitfield id="MSS_L2SLV2_ENABLE_CLR" width="1" begin="2" end="2" resetval="0x0" description="Interrupt Enable Clear Register for mss_l2slv2_pend" range="2" rwaccess="RW"/> 
		<bitfield id="MSS_L2SLV1_ENABLE_CLR" width="1" begin="1" end="1" resetval="0x0" description="Interrupt Enable Clear Register for mss_l2slv1_pend" range="1" rwaccess="RW"/> 
		<bitfield id="MSS_L2SLV0_ENABLE_CLR" width="1" begin="0" end="0" resetval="0x0" description="Interrupt Enable Clear Register for mss_l2slv0_pend" range="0" rwaccess="RW"/>
	</register>
	<register id="ECC_AGG_TOP_AGGR_ENABLE_SET" acronym="ECC_AGG_TOP_AGGR_ENABLE_SET" offset="0x200" width="8" description="">
		<bitfield id="TIMEOUT" width="1" begin="1" end="1" resetval="0x0" description="interrupt enable set for svbus timeout errors" range="1" rwaccess="RW"/> 
		<bitfield id="PARITY" width="1" begin="0" end="0" resetval="0x0" description="interrupt enable set for parity errors" range="0" rwaccess="RW"/>
	</register>
	<register id="ECC_AGG_TOP_AGGR_ENABLE_CLR" acronym="ECC_AGG_TOP_AGGR_ENABLE_CLR" offset="0x204" width="8" description="">
		<bitfield id="TIMEOUT" width="1" begin="1" end="1" resetval="0x0" description="interrupt enable clear for svbus timeout errors" range="1" rwaccess="RW"/> 
		<bitfield id="PARITY" width="1" begin="0" end="0" resetval="0x0" description="interrupt enable clear for parity errors" range="0" rwaccess="RW"/>
	</register>
	<register id="ECC_AGG_TOP_AGGR_STATUS_SET" acronym="ECC_AGG_TOP_AGGR_STATUS_SET" offset="0x208" width="8" description="">
		<bitfield id="TIMEOUT" width="2" begin="3" end="2" resetval="0x0" description="interrupt status set for svbus timeout errors" range="3 - 2" rwaccess="RW
	  			 INCR"/> 
		<bitfield id="PARITY" width="2" begin="1" end="0" resetval="0x0" description="interrupt status set for parity errors" range="1 - 0" rwaccess="RW
	  			 INCR"/>
	</register>
	<register id="ECC_AGG_TOP_AGGR_STATUS_CLR" acronym="ECC_AGG_TOP_AGGR_STATUS_CLR" offset="0x20C" width="8" description="">
		<bitfield id="TIMEOUT" width="2" begin="3" end="2" resetval="0x0" description="interrupt status clear for svbus timeout errors" range="3 - 2" rwaccess="RW
	  			 DECR"/> 
		<bitfield id="PARITY" width="2" begin="1" end="0" resetval="0x0" description="interrupt status clear for parity errors" range="1 - 0" rwaccess="RW
	  			 DECR"/>
	</register>
</module>